src/cf/InformationRegisters/КотировкиЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КотировкиЦБ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидКотировки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыКотировокЦБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыКотировокЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыКотировокЦБ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЦенаЗакрытия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/КотировкиЦБ/Ext/ManagerModule.bsl
// Модуль менеджера РегистрСведений.КотировкиЦБ
// Программный интерфейс для чтения котировок.

#Область ПрограммныйИнтерфейс

// Возвращает значение котировки на указанную дату (срез последних).
//
// Параметры:
//   ЦеннаяБумага - СправочникСсылка.ЦенныеБумаги
//   Дата         - Дата
//   ВидКотировки - ПеречислениеСсылка.ВидыКотировокЦБ - по умолчанию ЦенаЗакрытия
//
// Возвращаемое значение:
//   Число или Неопределено - значение котировки или Неопределено если данных нет
//
Функция ПолучитьКотировку(ЦеннаяБумага, Дата, ВидКотировки = Неопределено) Экспорт

	Если ВидКотировки = Неопределено Тогда
		ВидКотировки = Перечисления.ВидыКотировокЦБ.ЦенаЗакрытия;
	КонецЕсли;

	Отбор = Новый Структура;
	Отбор.Вставить("ЦеннаяБумага", ЦеннаяБумага);
	Отбор.Вставить("ВидКотировки", ВидКотировки);

	РезультатСреза = РегистрыСведений.КотировкиЦБ.ПолучитьПоследнее(Дата, Отбор);

	Если Не ЗначениеЗаполнено(РезультатСреза.Значение) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат РезультатСреза.Значение;

КонецФункции

#КонецОбласти
